** Ruby Playground                                                 :noexport:
   :PROPERTIES:
   :header-args: :exports none :results output
   :END:
   
   I'm not good with ruby so lets play with ruby
   
#+begin_src ruby :var test_numerals=test-numeral-values
  test_numerals.each do |(numeral, value)| 
    puts "Numeral: #{numeral}, value: #{value}"
  end
#+end_src

#+RESULTS:
: Numeral: III, value: 3
: Numeral: IV, value: 4
: Numeral: IX, value: 9
: Numeral: MCMXCIV, value: 1994
: Numeral: IIII, value: 
: Numeral: IL, value: 

How exactly would string destructuring work?

#+begin_src ruby
  first, *rest = "MCMXCIV".chars
  puts "first #{first}"
  puts "rest #{rest}"
#+end_src

#+RESULTS:
: first M
: rest ["C", "M", "X", "C", "I", "V"]

#+begin_src ruby :var symbol_values=symbol-values

  symbols = symbol_values.map {|(s, _)| s }
  puts symbols.zip(symbols.drop(1)).inspect
#+end_src

#+RESULTS:
: [["I", "V"], ["V", "X"], ["X", "L"], ["L", "C"], ["C", "D"], ["D", "M"], ["M", nil]]

#+begin_src ruby
  nested_nums = [[1, 2], [3, 4]]
  puts [*nested_nums, [5, 6]].map { |(x)| x}.reduce(0, :+)
  en = Enumerator.new do |enum|
    enum.yield 5
    enum.yield 12
  end
  puts (en.reduce(0, :+))
#+end_src

#+RESULTS:
: 9
: 17

ok, I'm seeing something really odd happen where variables inside of functions are not always always visible in an inner scope. Lets check that out.

[[https://apidock.com/ruby/Module/define_method][~define_method~]] [[https://stackoverflow.com/a/9671368/5056][Ruby local variable is undefined - Stack Overflow]] 

#+begin_src ruby
  def outer()
    foo = 123
    define_method(:inner) do
      p "inner - before:", foo
      foo = 456
      p "inner - after:", foo
    end
    p "outer - before", foo
    inner()
    p "outer - after", foo
  end
  outer
#+end_src

#+RESULTS:
: "outer - before"
: 123
: "inner - before:"
: 123
: "inner - after:"
: 456
: "outer - after"
: 456

*** Test it out
    #+begin_src ruby :session :var test_numeral_values=test-numeral-values :results value
      test-numeral-values.map do |(numeral, value)| 
        begin
          calculate_numeral_value(numeral)
        rescue CannotCreateNumeralError
          nil
        end
      end

    #+end_src

    #+RESULTS:
    | III     |    3 |
    | IV      |    4 |
    | IX      |    9 |
    | MCMXCIV | 1994 |
    | IIII    |      |
    | IL      |      |
    
    Yay! I should export that to its own files and run a ruby test on it but I got stuff to do right now
    
 #+STARTUP: content
